---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.NameIsEmpty
source: html/def09064-47a7-93ae-ec00-dc43f960e04a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.NameIsEmpty Property

Name is empty

## Syntax (C#)
```csharp
public static FailureDefinitionId NameIsEmpty { get; }
```